schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
/*****************************************************************************************************************************************************
 *                                                    D E F A U L T S E T T I N G S                                                                  *
 *****************************************************************************************************************************************************/
// clang-format off
boolean defaultsettings(){
    if(!SD_MMC.exists("/settings.json")){
        File file = SD_MMC.open("/settings.json","w", true);
        JSONVar jObject;
        jObject["volume"]            = (uint8_t)  12; // 0...21
        jObject["ringvolume"]        = (uint8_t)  21;
        jObject["alarmtime"]         = (uint16_t) 0;
        jObject["alarm_weekdays"]    = (uint8_t)  0;
        jObject["timeAnnouncing"]    = (bool)     true;
        jObject["mute"]              = (bool)     false; // no mute
        jObject["brightness"]        = (uint8_t)  100;  // 0...100
        jObject["sleeptime"]         = (uint16_t) 0;
        jObject["lastconnectedhost"] = (String)   "";
        jObject["station"]           = (uint16_t) 1;
        jObject["sumstations"]       = (uint16_t) 0;
        jObject["Timezone_Name"]     = (String)   "Europe/Berlin";
        jObject["Timezone_String"]   = (String)   "CET-1CEST,M3.5.0,M10.5.0/3";
        jObject["toneLP"]            = (int16_t)  0; // -40 ... +6 (dB)        audioI2S
        jObject["toneBP"]            = (int16_t)  0; // -40 ... +6 (dB)        audioI2S
        jObject["toneHP"]            = (int16_t)  0; // -40 ... +6 (dB)        audioI2S
        jObject["timeFormat"]        = (int8_t)   24;
        String jO = JSON.stringify(jObject);
        file.print(jO);
    }

    File file = SD_MMC.open("/settings.json","r", false);
    String jO = file.readString();
    _settingsHash = simpleHash(jO.c_str());
    JSONVar jV = JSON.parse(jO);
    _cur_volume         = (uint8_t)     jV["volume"];
    _ringvolume         = (uint8_t)     jV["ringvolume"];
    _alarmtime          = (uint16_t)    jV["alarmtime"];
    _alarmdays          = (uint8_t)     jV["alarm_weekdays"];
    _f_timeAnnouncement = (bool)        jV["timeAnnouncing"];
    _f_mute             = (bool)        jV["mute"];
    _brightness         = (uint8_t)     jV["brightness"];
    _sleeptime          = (uint16_t)    jV["sleeptime"];
    _cur_station        = (uint16_t)    jV["station"];
    _sum_stations       = (uint16_t)    jV["sumstations"];
    _toneLP             = (int16_t)     jV["toneLP"];
    _toneBP             = (int16_t)     jV["toneBP"];
    _toneHP             = (int16_t)     jV["toneHP"];
    _timeFormat         = (uint8_t)     jV["timeFormat"];

    bool f_updateSettings = false;
    if(!(const char*)jV["Timezone_Name"]     ) f_updateSettings = true;  else _TZName             = (const char*) jV["Timezone_Name"];
    if(!(const char*)jV["Timezone_String"]   ) f_updateSettings = true;  else _TZString           = (const char*) jV["Timezone_String"];
    if(!(const char*) jV["lastconnectedhost"]) f_updateSettings = true;  else _lastconnectedhost  = (const char*) jV["lastconnectedhost"];
    if(f_updateSettings) updateSettings();

    if(!pref.isKey("stations_filled")|| _sum_stations == 0) saveStationsToNVS();  // first init
    if(pref.getShort("IR_numButtons", 0) == 0) saveDefaultIRbuttonsToNVS();
    loadIRbuttonsFromNVS();
    return true;
}
// clang-format on

boolean saveStationsToNVS() {
    String   Hide = "", Cy = "", StationName = "", StreamURL = "", currentLine = "", tmp = "";
    uint16_t cnt = 0;
    // StationList
    if(!SD_MMC.exists("/stations.csv")) {
        SerialPrintfln(ANSI_ESC_RED "SD_MMC/stations.csv not found");
        return false;
    }

    File file = SD_MMC.open("/stations.csv");
    if(file) {                                        // try to read from SD_MMC
        stations.clear();
        currentLine = file.readStringUntil('\n');     // read the headline
        while(file.available()) {
            currentLine = file.readStringUntil('\n'); // read the line
            uint p = 0, q = 0;
            Hide = "";
            Cy = "";
            StationName = "";
            StreamURL = "";
            for(int32_t i = 0; i < currentLine.length() + 1; i++) {
                if(currentLine[i] == '\t' || i == currentLine.length()) {
                    if(p == 0) Hide = currentLine.substring(q, i);
                    if(p == 1) Cy = currentLine.substring(q, i);
                    if(p == 2) StationName = currentLine.substring(q, i);
                    if(p == 3) StreamURL = currentLine.substring(q, i);
                    p++;
                    i++;
                    q = i;
                }
            }
            if(Hide == "*") continue;
            if(StationName == "") continue; // is empty
            if(StreamURL == "") continue;   // is empty
            SerialPrintfln("Cy=%s, StationName=%s, StreamURL=%s", Cy.c_str(), StationName.c_str(), StreamURL.c_str());
            cnt++;
            if(cnt == _max_stations) {
                SerialPrintfln(ANSI_ESC_RED "No more than %d entries in stationlist allowed!", _max_stations);
                cnt--; // maxstations 999
                break;
            }
            tmp = StationName + "#" + StreamURL;
            sprintf(_chbuf, "station_%03d", cnt);
            stations.putString(_chbuf, tmp);
        }
        _sum_stations = cnt;
        stations.putLong("stations.size", file.size());
        file.close();
        pref.putBool("stations_filled", true);
        SerialPrintfln("stationlist internally loaded");
        SerialPrintfln("number of stations: " ANSI_ESC_CYAN "%i", cnt);
        return true;
    }
    else
        return false;
}

boolean saveDefaultIRbuttonsToNVS() { // default values, first init
    pref.putShort("irAddress", 0x00);
    pref.putShort("button_0", 0x52);  // '0';
    pref.putShort("button_1", 0x16);  // '1';
    pref.putShort("button_2", 0x19);  // '2';
    pref.putShort("button_3", 0x0D);  // '3';
    pref.putShort("button_4", 0x0C);  // '4';
    pref.putShort("button_5", 0x18);  // '5';
    pref.putShort("button_6", 0x5E);  // '6';
    pref.putShort("button_7", 0x08);  // '7';
    pref.putShort("button_8", 0x1C);  // '8';
    pref.putShort("button_9", 0x5A);  // '9';
    pref.putShort("button_10", 0x40); // 'm';  // MUTE
    pref.putShort("button_11", 0x46); // 'u';  // VOLUME+
    pref.putShort("button_12", 0x15); // 'd';  // VOLUME-
    pref.putShort("button_13", 0x43); // 'p';  // PREVIOUS STATION
    pref.putShort("button_14", 0x44); // 'n';  // NEXT STATION
    pref.putShort("button_15", 0x4A); // 'k';  // CLOCK <--> RADIO
    pref.putShort("button_16", 0x42); // 's';  // OFF TIMER
    pref.putShort("button_17", 0x00); // '0';
    pref.putShort("button_18", 0x00); // '0';
    pref.putShort("button_19", 0x00); // '0';

    pref.putShort("IR_numButtons", 20);
    // log_i("saveDefaultIRbuttonsToNVS");

    loadIRbuttonsFromNVS();

