schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
    return true;
}

void saveIRbuttonsToNVS() {
    uint8_t  ir_addr = ir.get_irAddress();
    uint8_t* ir_buttons = ir.get_irButtons();
    char     buf[12];
    pref.putShort("irAddress", ir_addr);
    for(uint8_t i = 0; i < 20; i++) {
        sprintf(buf, "button_%d", i);
        pref.putShort(buf, ir_buttons[i]);
        log_i("i=%i ir_buttons[i] %i", i, ir_buttons[i]);
    }
    pref.putShort("IR_numButtons", 20);
}

void loadIRbuttonsFromNVS() {
    // load IR settings from NVS
    uint numButtons = pref.getShort("IR_numButtons", 0);
    ir.set_irAddress(pref.getShort("irAddress", 0));
    char    buf[12];
    uint8_t cmd = 0;
    for(uint i = 0; i < numButtons; i++) {
        sprintf(buf, "button_%d", i);
        cmd = pref.getShort(buf, 0);
        ir.set_irButtons(i, cmd);
    }
}

// clang-format off
void updateSettings(){
    if(!_lastconnectedhost)_lastconnectedhost = "";
    JSONVar jObject;
    jObject["volume"]            = (uint8_t)  _cur_volume;
    jObject["ringvolume"]        = (uint8_t)  _ringvolume;
    jObject["alarmtime"]         = (uint16_t) _alarmtime;
    jObject["alarm_weekdays"]    = (uint8_t)  _alarmdays;
    jObject["timeAnnouncing"]    = (bool)     _f_timeAnnouncement;
    jObject["mute"]              = (bool)     _f_mute;
    jObject["brightness"]        = (uint8_t)  _brightness;
    jObject["sleeptime"]         = (uint16_t) _sleeptime;
    jObject["lastconnectedhost"] = (String)   _lastconnectedhost;
    jObject["station"]           = (uint16_t) _cur_station;
    jObject["sumstations"]       = (uint16_t) _sum_stations;
    jObject["toneLP"]            = (int16_t)  _toneLP; // -40 ... +6 (dB)        audioI2S
    jObject["toneBP"]            = (int16_t)  _toneBP; // -40 ... +6 (dB)        audioI2S
    jObject["toneHP"]            = (int16_t)  _toneHP; // -40 ... +6 (dB)        audioI2S
    jObject["Timezone_Name"]     = (String)   _TZName;
    jObject["Timezone_String"]   = (String)   _TZString;
    jObject["timeFormat"]        = (uint8_t)  _timeFormat;

    String jO = JSON.stringify(jObject);
    if(_settingsHash != simpleHash(jO.c_str())) {
        File file = SD_MMC.open("/settings.json", "w", false);
        if(!file) {
            log_e("file \"settings.json\" not found");
            return;
        }
        file.print(jO);
        _settingsHash = simpleHash(jO.c_str());
    }
}
// clang-format on

/*****************************************************************************************************************************************************
 *                                                    F I L E   E X P L O R E R                                                                      *
 *****************************************************************************************************************************************************/
// Sends a list of the content of a directory as JSON file
const char* SD_stringifyDirContent(String path) {
    uint16_t JSONstrLength = 0;
    uint8_t  isDir = 0;
    uint16_t fnLen = 0; // length of file mame
    uint8_t  fsLen = 0; // length of file size
    if(_JSONstr){free(_JSONstr); _JSONstr = NULL;}
    if(!SD_listDir(path.c_str(), false, false)) return "[]"; // if success: result will be in _SD_content
    if(psramFound()) { _JSONstr = (char*)ps_malloc(2); }
    else             { _JSONstr = (char*)malloc(2);}
    JSONstrLength += 2;
    memcpy(_JSONstr, "[\0", 2);
    if(!_SD_content.size()) return "[]"; // empty?

    for(int i = 0; i < _SD_content.size(); i++) { // build a JSON string in PSRAM, e.g. [{"name":"m","dir":true},{"name":"s","dir":true}]
        const char* fn = _SD_content[i];
        if(startsWith(fn, "/.")) continue;        // ignore hidden folders
        int16_t idx = indexOf(fn, "\033", 1);     // idx >0 we have size (after ANSI ESC SEQUENCE)
        if(idx > 0) {
            isDir = 0;
            fnLen = idx;
            fsLen = strlen(fn) - (idx + 6);          // "033[33m"
            JSONstrLength += fnLen + 24 + 8 + fsLen; // {"name":"test.mp3","dir":false,"size":"3421"}
        }
        else {
            isDir = 1;
            fnLen = strlen(fn);
            fsLen = 0;
            JSONstrLength += fnLen + 23 + 11;
        }
        if(psramFound()) { _JSONstr = (char*)ps_realloc(_JSONstr, JSONstrLength); }
        else             { _JSONstr = (char*)realloc(_JSONstr, JSONstrLength); }

        strcat(_JSONstr, "{\"name\":\"");
        strncat(_JSONstr, fn, fnLen);
        strcat(_JSONstr, "\",\"dir\":");
        if(isDir) { strcat(_JSONstr, "true"); }
        else      { strcat(_JSONstr, "false"); }
        if(!isDir) {
            strcat(_JSONstr, ",\"size\":");
            strncat(_JSONstr, fn + idx + 6, fsLen);
        }
        else {
            strcat(_JSONstr, ",\"size\": \"\"");
        }
        strcat(_JSONstr, "},");
    }
    _JSONstr[JSONstrLength - 2] = ']'; // replace comma by square bracket close
    return _JSONstr;
}

// Sends a list of the content of a directory as JSON file
String DLNA_dirContent(String path) {
    // File root, file;
    // JSONVar jObject, jArr;
    // int32_t i = 0;
    // if(path =="") path = "/";
    // root = SD_MMC.open(path.c_str());

    // if (!root.isDirectory()) {
    //     SerialPrintfln("FileExplorer:" ANSI_ESC_RED "%s is not a directory", path.c_str());
    //     return "";
    // }
    // while (true) {
    //     file = root.openNextFile();
    //     if(!file) break;
    //     if (startsWith(file.name() , "/.")) continue;  // ignore hidden folders
    //     jArr["name"] = (String)file.name();
    //     jArr["dir"]  = (boolean)file.isDirectory();
    //     jObject[i]   = jArr;
    //     i++;
    // }
    // file.close();
    // root.close();
    // if(i){
    //     String jO = JSON.stringify(jObject);
    //     // log_i("%s", jO.c_str());
    //     return jO;
    // }
    return "";
}

/*****************************************************************************************************************************************************
 *                                                    T F T   B R I G H T N E S S                                                                    *
 *****************************************************************************************************************************************************/
void setTFTbrightness(uint8_t duty) {       // duty 0...100 (min...max)
    if(TFT_BL == -1) return;
#if ESP_IDF_VERSION_MAJOR < 5
    ledcSetup(0, 1200, 8);                  // 1200 Hz PWM and 8 bit resolution
    ledcAttachPin(TFT_BL, 0);               // Configure variable led, TFT_BL pin to channel 1
#else
    ledcAttach(TFT_BL, 1200, 8); // 1200 Hz PWM and 8 bit resolution
#endif
    uint8_t d = round((double)duty * 2.55); // #186
    ledcWrite(0, d);
}

inline uint8_t downBrightness() {
    if(_brightness > 5) {
        _brightness -= 5;
        setTFTbrightness(_brightness);
        showBrightnessBar();
        log_i("br %i", _brightness);
    }
    return _brightness;
}

inline uint8_t upBrightness() {
    if(_brightness < 100) {
        _brightness += 5;
        setTFTbrightness(_brightness);
        showBrightnessBar();
        log_i("br %i", _brightness);
    }
    return _brightness;
}
inline uint8_t getBrightness() { return _brightness; }

