schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
void showFooterRSSI_bt(int8_t rssi) {
    if(_state != A2DP_SINK) return;  //guard
    if(_f_BTconnected == false && rssi != -100) return; // -100 means disconnected event, set level to 0
    boolean show = false;
    static int32_t old_rssi = -1;
    int32_t        new_rssi = -1;
    if(rssi <   1) new_rssi = 4;
    if(rssi < -10) new_rssi = 3;
    if(rssi < -35) new_rssi = 2;
    if(rssi < -55) new_rssi = 1;
    if(rssi < -85) new_rssi = 0;

    if(new_rssi != old_rssi) {
        old_rssi = new_rssi; // no need to draw a rssi icon if rssiRange has not changed
        if(ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO) {
            static int32_t tmp_rssi = 0;
            if((abs(rssi - tmp_rssi) > 3)) { SerialPrintfln("BT_rssi:     RSSI is " ANSI_ESC_CYAN "%d" ANSI_ESC_WHITE " dB", rssi); }
            tmp_rssi = rssi;
        }
        show = true;
    }
    if(show && !_timeCounter.timer) {
        switch(new_rssi) {
        case 4: {
            drawImage("/common/RSSI4_bt.bmp", _winRSSID_bt.x, _winRSSID_bt.y + 2);
            break;
        }
        case 3: {
            drawImage("/common/RSSI3_bt.bmp", _winRSSID_bt.x, _winRSSID_bt.y + 2);
            break;
        }
        case 2: {
            drawImage("/common/RSSI2_bt.bmp", _winRSSID_bt.x, _winRSSID_bt.y + 2);
            break;
        }
        case 1: {
            drawImage("/common/RSSI1_bt.bmp", _winRSSID_bt.x, _winRSSID_bt.y + 2);
            break;
        }
        case 0: {
            drawImage("/common/RSSI0_bt.bmp", _winRSSID_bt.x, _winRSSID_bt.y + 2);
            break;
        }
        }
    }
}

void showFooterBitRate(uint16_t br) {
    xSemaphoreTake(mutex_display, portMAX_DELAY);
    clearBitRate();
    char sbr[10];
    itoa(br, sbr, 10);
    if(br < 1000) { strcat(sbr, "K"); }
    else {
        sbr[2] = sbr[1];
        sbr[1] = '.';
        sbr[3] = 'M';
        sbr[4] = '\0';
    }
    tft.setFont(_fonts[1]);
    tft.setTextColor(TFT_LAVENDER);
    uint8_t space = 2;
    if(strlen(sbr) < 4) space += 5;
    tft.writeText(sbr,_winBitRate.x + space, _winBitRate.y, _winBitRate.w, _winBitRate.h);
    xSemaphoreGive(mutex_display);
}

void updateSleepTime(boolean noDecrement) { // decrement and show new value in footer
    if(_f_sleeping) return;
    boolean sleep = false;
    xSemaphoreTake(mutex_display, portMAX_DELAY);
    clearSleep();
    drawImage("/common/Hourglass_blue.bmp", _winSleep.x, _winSleep.y);
    uint8_t offset = 0;
    if(TFT_CONTROLLER < 2) offset = 28;
    else
        offset = 33;
    if(_sleeptime == 1) sleep = true;
    if(_sleeptime > 0 && !noDecrement) _sleeptime--;

    char Slt[15];
    sprintf(Slt, "%d:%02d", _sleeptime / 60, _sleeptime % 60);
    tft.setFont(_fonts[1]);
    if(!_sleeptime) {
        drawImage("/common/Hourglass_blue.bmp", _winSleep.x, _winSleep.y);
        tft.setTextColor(TFT_DEEPSKYBLUE);
    }
    else {
        drawImage("/common/Hourglass_red.bmp", _winSleep.x, _winSleep.y);
        tft.setTextColor(TFT_RED);
    }
    tft.writeText(Slt, _winSleep.x + offset, _winSleep.y, _winSleep.w, _winSleep.h);

    xSemaphoreGive(mutex_display);
    if(sleep) { // fall asleep
        fall_asleep();
        _sleeptime = 0;
    }
}
void showVolumeBar() {
    uint16_t val = tft.width() * getvolume() / 21;
    clearVolBar();
    tft.fillRect(_winVolBar.x, _winVolBar.y + 1, val, _winVolBar.h - 2, TFT_RED);
    tft.fillRect(val + 1, _winVolBar.y + 1, tft.width() - val + 1, _winVolBar.h - 2, TFT_GREEN);
    _f_volBarVisible = true;
}

void updateVUmeter() {
    if(_state != RADIO) return;
    if(_f_state_isChanging) return;
    if(_f_sleeping) return;
    if(_f_irNumberSeen) return;
    xSemaphoreTake(mutex_display, portMAX_DELAY);
    uint8_t width = 0, height = 0, xOffs = 0, yOffs = 0, xStart = 0, yStart = 0;
#if TFT_CONTROLLER < 2 // 320 x 240px
    width = 9;
    height = 7;
    xOffs = 11;
    yOffs = 8;
    xStart = 2;
    yStart = 90;
#else // 480 x 320px
    width = 12;
    height = 8;
    xOffs = 16;
    yOffs = 10;
    xStart = 2;
    yStart = 115;
#endif

    // c99 has no inner functions, lambdas are only allowed from c11, please don't use ancient compiler
    auto drawRect = [&](uint8_t pos, uint8_t ch, bool br) { // lambda, inner function
        uint16_t color = 0, xPos = _winVUmeter.x + xStart + ch * xOffs, yPos = _winVUmeter.y + yStart - pos * yOffs;
        if(pos > 11) return;
        switch(pos) {
        case 0 ... 6: // green
            br ? color = TFT_GREEN : color = TFT_DARKGREEN;
            break;
        case 7 ... 9: // yellow
            br ? color = TFT_YELLOW : color = TFT_DARKYELLOW;
            break;
        case 10 ... 11: // red
            br ? color = TFT_RED : color = TFT_DARKRED;
            break;
        }
        tft.fillRect(xPos, yPos, width, height, color);
    };

    uint16_t vum = audioGetVUlevel();

    uint8_t left = map_l(vum >> 8, 0, 127, 0, 11);
    uint8_t right = map_l(vum & 0x00FF, 0, 127, 0, 11);

    if(left > _VUleftCh) {
        for(int32_t i = _VUleftCh; i < left; i++) { drawRect(i, 1, 1); }
    }
    if(left < _VUleftCh) {
        for(int32_t i = left; i < _VUleftCh; i++) { drawRect(i, 1, 0); }
    }
    _VUleftCh = left;

    if(right > _VUrightCh) {
        for(int32_t i = _VUrightCh; i < right; i++) { drawRect(i, 0, 1); }
    }
    if(right < _VUrightCh) {
        for(int32_t i = right; i < _VUrightCh; i++) { drawRect(i, 0, 0); }
    }
    _VUrightCh = right;
    xSemaphoreGive(mutex_display);
}

void showBrightnessBar() {
    uint16_t val = tft.width() * getBrightness() / 100;
    clearVolBar();
    tft.fillRect(_winVolBar.x, _winVolBar.y + 1, val, _winVolBar.h - 2, TFT_RED);
    tft.fillRect(val + 1, _winVolBar.y + 1, tft.width() - val + 1, _winVolBar.h - 2, TFT_GREEN);
    _f_volBarVisible = true;
}
void showFooter() { // stationnumber, sleeptime, IPaddress
    showFooterStaNr();
    updateSleepTime(true);
    showFooterIPaddr();
    showFooterRSSI(true);
    showFooterBitRate(_icyBitRate);
}
void display_info(const char* str, int32_t xPos, int32_t yPos, uint16_t color, uint16_t margin_l, uint16_t margin_r, uint16_t winWidth, uint16_t winHeight) {
    tft.fillRect(xPos, yPos, winWidth, winHeight, TFT_BLACK); // Clear the space for new info
    tft.setTextColor(color);                                  // Set the requested color
    uint16_t ch_written = tft.writeText(str, xPos + margin_l, yPos, winWidth - margin_r, winHeight, false);
    if(ch_written < strlenUTF8(str)) {
        // If this message appears, there is not enough space on the display to write the entire text,
        // a part of the text has been cut off
        SerialPrintfln("txt overflow, winHeight=" ANSI_ESC_CYAN "%d" ANSI_ESC_WHITE ", strlen=" ANSI_ESC_CYAN "%d" ANSI_ESC_WHITE
                       ", written=" ANSI_ESC_CYAN "%d" ANSI_ESC_WHITE ", str=" ANSI_ESC_CYAN "%s",
                       winHeight, strlenUTF8(str), ch_written, str);
    }
}
void showStreamTitle(const char* streamtitle) {
    if(_f_sleeping) return;
    xSemaphoreTake(mutex_display, portMAX_DELAY);
    String ST = streamtitle;

    ST.trim();               // remove all leading or trailing whitespaces
    ST.replace(" | ", "\n"); // some stations use pipe as \n or
    ST.replace("| ", "\n");  // or
    ST.replace("|", "\n");
    switch(strlenUTF8(ST.c_str())) {
    case 0 ... 30: tft.setFont(_fonts[5]); break;
    case 31 ... 43: tft.setFont(_fonts[4]); break;
    case 44 ... 65: tft.setFont(_fonts[3]); break;
    case 66 ... 130: tft.setFont(_fonts[2]); break;
    case 131 ... 200: tft.setFont(_fonts[1]); break;
    default: tft.setFont(_fonts[0]); break;
    }
    display_info(ST.c_str(), _winSTitle.x, _winSTitle.y, TFT_CORNSILK, 2, 10, _winSTitle.w, _winSTitle.h);
    xSemaphoreGive(mutex_display);
}
void showVUmeter() {
    if(_f_sleeping) return;
    xSemaphoreTake(mutex_display, portMAX_DELAY);
    drawImage("/common/level_bar.jpg", _winVUmeter.x, _winVUmeter.y);
    _VUrightCh = 0;
    _VUleftCh = 0;
    xSemaphoreGive(mutex_display);
}

