schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
void showLogoAndStationName() {
    xSemaphoreTake(mutex_display, portMAX_DELAY);
    clearLogoAndStationname();
    xSemaphoreGive(mutex_display);
    String SN_utf8 = "";
    if(_cur_station) { SN_utf8 = _stationName_nvs; }
    else { SN_utf8 = _stationName_air; }
    SN_utf8.trim();

    showStationName(SN_utf8);

    showStationLogo(SN_utf8);
}

void showStationName(String sn) {
    xSemaphoreTake(mutex_display, portMAX_DELAY);
    switch(strlenUTF8(sn.c_str())) {
    case 0  ...  8: tft.setFont(_fonts[7]); break;
    case 9  ... 11: tft.setFont(_fonts[6]); break;
    case 12 ... 20: tft.setFont(_fonts[5]); break;
    case 21 ... 32: tft.setFont(_fonts[4]); break;
    case 33 ... 45: tft.setFont(_fonts[3]); break;
    case 46 ... 60: tft.setFont(_fonts[2]); break;
    case 61 ... 90: tft.setFont(_fonts[1]); break;
    default: tft.setFont(_fonts[0]); break;
    }
    display_info(sn.c_str(), _winName.x, _winName.y, TFT_CYAN, 10, 0, _winName.w, _winName.h);
    xSemaphoreGive(mutex_display);
}

void showStationLogo(String ln) {
    xSemaphoreTake(mutex_display, portMAX_DELAY);
    String logo = "/logo/" + (String)ln.c_str() + ".jpg";
    if(drawImage(logo.c_str(), 0, _winName.y + 2) == false) {
        drawImage("/common/unknown.jpg", 0, _winName.y + 2); // if no draw unknown
        _f_logoUnknown = true;
    }
    xSemaphoreGive(mutex_display);
}

void showFileLogo(uint8_t state) {
    xSemaphoreTake(mutex_display, portMAX_DELAY);
    String logo;
    if(state == RADIO) {
        if(endsWith(_stationURL, "m3u8")) logo = "/common/" + (String) "M3U8" + ".jpg";
        else
            logo = "/common/" + (String)codecname[_cur_Codec] + ".jpg";
    }
    else if(state == DLNA)     { logo = "/common/DLNA.jpg"; }
    else if(state == PLAYER)   { logo = "/common/AudioPlayer.jpg";}
    else if(state == A2DP_SINK){_f_BTconnected? logo = "/common/BT.jpg" : logo = "/common/BTnc.jpg";}
    else if(state == UNDEFINED){ clearLogo(); goto exit;}
    else { // _state PLAYER or PLAYERico
        logo = "/common/" + (String)codecname[_cur_Codec] + ".jpg";
    }
    if(drawImage(logo.c_str(), 0, _winName.y + 2) == true) { webSrv.send("stationLogo=" + logo); }
    else {
        (drawImage("/common/unknown.jpg", 0, _winName.y + 2));
        webSrv.send("stationLogo=");
    }
exit:
    xSemaphoreGive(mutex_display);
}

void showFileName(const char* fname) {
    if(!fname) return;
    switch(strlenUTF8(fname)) {
    case 0 ... 15: tft.setFont(_fonts[5]); break;
    case 16 ... 30: tft.setFont(_fonts[4]); break;
    case 31 ... 70: tft.setFont(_fonts[3]); break;
    case 71 ... 100: tft.setFont(_fonts[2]); break;
    case 101 ... 150: tft.setFont(_fonts[1]); break;
    default: tft.setFont(_fonts[0]); break;
    }
    display_info(fname, _winName.x, _winName.y, TFT_CYAN, 0, 0, _winName.w, _winName.h);
}

void showFileNumber(){
    tft.setFont(_fonts[3]);
    char buf[15];
    if(_f_playlistEnabled){
        sprintf(buf, "%03u/%03u", _plsMaxEntries - _plsEntries + 1, _plsMaxEntries);
        display_info(buf, _winFileNr.x, _winFileNr.y, TFT_ORANGE, 10, 0, _winFileNr.w, _winFileNr.h);
    }
    else{
        if(!_f_shuffle) {sprintf(buf, "%03u/%03u", (unsigned int)_cur_AudioFileNr + 1, (unsigned int)_audioFilesInList);}
        else            {sprintf(buf, "%03u/%03u", _shuffleArray[_cur_AudioFileNr] + 1, _audioFilesInList);}
        display_info(buf, _winFileNr.x, _winFileNr.y, TFT_DEEPSKYBLUE, 10, 0, _winFileNr.w, _winFileNr.h);
    }
}

void showStationsList(uint16_t staListNr){
    clearWithOutHeaderFooter();
    if(_sum_stations < 11) staListNr = 0;
    else if(staListNr + 9 > _max_stations) staListNr = _max_stations - 9;
    showHeadlineItem(STATIONSLIST);
    tft.setFont(_fonts[0]);
    uint8_t lineHight = _winWoHF.h / 10;
    for(uint8_t pos = 0; pos < 10; pos++){
        if(pos + staListNr + 1 > _sum_stations) break;
        sprintf(_chbuf, "station_%03d", pos + staListNr  + 1);
        String content = stations.getString(_chbuf, " #not_found");
        content.replace('#','\0');
        sprintf(_chbuf, ANSI_ESC_YELLOW"%03d " ANSI_ESC_WHITE "%s\n",pos + staListNr  + 1, content.c_str());
       tft.writeText(_chbuf, 10, _winFooter.h + (pos) * lineHight, _dispWidth -10 ,lineHight, TFT_ALIGN_LEFT, true, true);
    }
    _timeCounter.timer = 10;
    _timeCounter.factor = 1.0;
}


void display_time(boolean showall) { // show current time on the TFT Display
    static String  t, oldt = "";
    static boolean k = false;
    uint8_t        i = 0;
    if(showall == true) { oldt = "        ";}
    if((_state == CLOCK) || (_state == CLOCKico)) {
        if(_timeFormat == 12) t = rtc.gettime_xs_12h(); // 01:27 PM
        else                  t = rtc.gettime_xs();     // 13:27

        for(i = 0; i < 5; i++) {
            if(t[i] == ':') {
                if(k == false) {
                    k = true;
                    t[i] = 'd';
                }
                else {
                    t[i] = 'e';
                    k = false;
                }
            }
            if(_timeFormat == 12){
                if(t[i] != oldt[i]) {
                    sprintf(_chbuf, "/digits/foldedNumbers/%cwhite.jpg", t[i]);
                    drawImage(_chbuf, _alarmtimeXPosFN[i], _winDigits.y);
                    if(i == 4){
                        if(t.substring(6,8) == "PM"){
                            drawImage("/digits/foldedNumbers/pmwhite.jpg", _alarmtimeXPosFN[5], _winDigits.y);
                        }
                        else{
                            drawImage("/digits/foldedNumbers/amwhite.jpg", _alarmtimeXPosFN[5], _winDigits.y);
                        }
                    }
                }
            }
            else{
                if(t[i] != oldt[i]) { // 24h representation
                    sprintf(_chbuf, "/digits/sevenSegment/%cgreen.jpg", t[i]);
                    drawImage(_chbuf, _alarmtimeXPos7S[i], _winDigits.y);
                }
            }
        }
        oldt = t;
    }
}

