schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
void display_alarmDays(uint8_t ad, boolean showall) { // Sun ad=0, Mon ad=1, Tue ad=2 ....
    uint8_t i = 0;
    String  str = "";

    if(!showall) _alarmdays ^= (1 << ad); // toggle bit

    for(i = 0; i < 7; i++) {
        str = "/day/" + String(i);
        if(_alarmdays & (1 << i)) str += "_rt_en.bmp"; // l << i instead pow(2,i)
        else
            str += "_gr_en.bmp";
        drawImage(str.c_str(), _alarmdaysXPos[i], _winAlarmDays.y);
    }
}

void display_alarmtime(int8_t xy, int8_t ud, boolean showall) {
    static int8_t pos, h, m;
    int8_t        updatePos = -1, oldPos = -1;

    if(showall) {
        h = _alarmtime / 60;
        m = _alarmtime % 60;
    }

    if(ud == 1) {
        if(pos == 0)
            if(((h / 10) == 1 && (h % 10) < 4) || ((h / 10) == 0)) {
                h += 10;
                updatePos = 0;
            }
        if(pos == 1)
            if(((h / 10) == 2 && (h % 10) < 3) || ((h / 10) < 2 && (h % 10) < 9)) {
                h++;
                updatePos = 1;
            }
        if(pos == 2)
            if((m / 10) < 5) {
                m += 10;
                updatePos = 2;
            }
        if(pos == 3)
            if((m % 10) < 9) {
                m++;
                updatePos = 3;
            }
        _alarmtime = h * 60 + m;
    }
    if(ud == -1) {
        if(pos == 0)
            if((h / 10) > 0) {
                h -= 10;
                updatePos = 0;
            }
        if(pos == 1)
            if((h % 10) > 0) {
                h--;
                updatePos = 1;
            }
        if(pos == 2)
            if((m / 10) > 0) {
                m -= 10;
                updatePos = 2;
            }
        if(pos == 3)
            if((m % 10) > 0) {
                m--;
                updatePos = 3;
            }
        _alarmtime = h * 60 + m;
    }

    if(xy == 1) {
        oldPos = pos++;
        if(pos == 4) pos = 0;
        updatePos = pos; // pos 0...3 only
    }
    if(xy == -1) {
        oldPos = pos--;
        if(pos == -1) pos = 3;
        updatePos = pos;
    }

    char hhmm[15];
    sprintf(hhmm, "%d%d%d%d", h / 10, h % 10, m / 10, m % 10);

    if(showall) {
        drawImage("/digits/sevenSegment/dred.jpg", _alarmtimeXPos7S[2], _winDigits.y); // colon
    }

    for(uint8_t i = 0; i < 4; i++) {
        uint8_t p = i;
        if(i > 1) p++; // skip colon
        strcpy(_path, "/digits/sevenSegment/");
        strncat(_path, (const char*)hhmm + i, 1);
        if(showall) {
            if(i == pos) strcat(_path, "orange.jpg"); // show orange number
            else
                strcat(_path, "red.jpg");          // show red numbers

            drawImage(_path, _alarmtimeXPos7S[p], _winDigits.y);
        }

        else {
            if(i == updatePos) {
                strcat(_path, "orange.jpg");
                drawImage(_path, _alarmtimeXPos7S[p], _winDigits.y);
            }
            if(i == oldPos) {
                strcat(_path, "red.jpg");
                drawImage(_path, _alarmtimeXPos7S[p], _winDigits.y);
            }
        }
    }
}

void display_sleeptime(int8_t ud) { // set sleeptimer
    if(ud == 1) {
        switch(_sleeptime) {
        case 0 ... 14: _sleeptime = (_sleeptime / 5) * 5 + 5; break;
        case 15 ... 59: _sleeptime = (_sleeptime / 15) * 15 + 15; break;
        case 60 ... 359: _sleeptime = (_sleeptime / 60) * 60 + 60; break;
        default: _sleeptime = 360; break; // max 6 hours
        }
    }
    if(ud == -1) {
        switch(_sleeptime) {
        case 1 ... 15: _sleeptime = ((_sleeptime - 1) / 5) * 5; break;
        case 16 ... 60: _sleeptime = ((_sleeptime - 1) / 15) * 15; break;
        case 61 ... 360: _sleeptime = ((_sleeptime - 1) / 60) * 60; break;
        default: _sleeptime = 0; break; // min
        }
    }
    char tmp[10];
    sprintf(tmp, "%d%02d", _sleeptime / 60, _sleeptime % 60);
    char path[128] = "/digits_small/";

    for(uint8_t i = 0; i < 4; i++) {
        strcpy(path, "/digits_small/");
        if(i == 3) {
            if(!_sleeptime) strcat(path, "dsgn.jpg");
            else
                strcat(path, "dsrt.jpg");
        }
        else {
            strncat(path, (tmp + i), 1);
            if(!_sleeptime) strcat(path, "sgn.jpg");
            else
                strcat(path, "srt.jpg");
        }
        drawImage(path, _sleeptimeXPos[i], 48);
    }
}

boolean drawImage(const char* path, uint16_t posX, uint16_t posY, uint16_t maxWidth, uint16_t maxHeigth) {
    const char* scImg = scaleImage(path);
    if(!SD_MMC.exists(scImg)) {
        if(indexOf(scImg, "/.", 0) > 0) return false; // empty filename
        SerialPrintfln("AUDIO_info:  " ANSI_ESC_RED "file \"%s\" not found", scImg);
        return false;
    }
    if(endsWith(scImg, "bmp")) {
        return tft.drawBmpFile(SD_MMC, scImg, posX, posY, maxWidth, maxHeigth);
    }
    if(endsWith(scImg, "jpg")) {
        return tft.drawJpgFile(SD_MMC, scImg, posX, posY, maxWidth, maxHeigth);
    }
    if(endsWith(scImg, "gif")) {
        return tft.drawGifFile(SD_MMC, scImg, posX, posY, 0);
    }

    SerialPrintfln(ANSI_ESC_RED "the file \"%s\" contains neither a bmp, a gif nor a jpj graphic", scImg);
    return false; // neither jpg nor bmp
}
/*****************************************************************************************************************************************************
 *                                                   H A N D L E  A U D I O F I L E                                                                  *
 *****************************************************************************************************************************************************/
bool SD_listDir(const char* path, boolean audioFilesOnly, boolean withoutDirs){ // sort the content of an given directory and lay it in the
    File file;                                                                  // vector _SD_content, add to filename ANSI_ESC_YELLOW and file size
    vector_clear_and_shrink(_SD_content);
    _audioFilesInList = 0;
    if(audioFile) audioFile.close();
    if(!SD_MMC.exists(path)){
        SerialPrintfln(ANSI_ESC_RED "SD_MMC/%s not exist", path);
        return false;
    }
    audioFile = SD_MMC.open(path);
    if(!audioFile.isDirectory()) {
        SerialPrintfln(ANSI_ESC_RED "SD_MMC/%s is not a directory", path);
        audioFile.close();
        return false;
    }
    while(true) {    // get content
        file = audioFile.openNextFile();
        if(!file) break;
        if(file.isDirectory()){
            if(!withoutDirs){
                _chbuf[0] = 2; // ASCII: start of text, sort set dirs on first position
                sprintf(_chbuf + 1, "%s", file.name());
                _SD_content.push_back(x_ps_strdup((const char*)_chbuf));
            }
        }
        else {
            if(audioFilesOnly){
                if(endsWith(file.name(), ".mp3") || endsWith(file.name(), ".aac") || endsWith(file.name(), ".m4a") || endsWith(file.name(), ".wav") ||
                    endsWith(file.name(), ".flac") || endsWith(file.name(), ".m3u") || endsWith(file.name(), ".opus") || endsWith(file.name(), ".ogg")) {
                        sprintf(_chbuf, "%s" ANSI_ESC_YELLOW " %d", file.name(), file.size());
                        _SD_content.push_back(x_ps_strdup((const char*) _chbuf));
                }
            }
            else{
                sprintf(_chbuf, "%s" ANSI_ESC_YELLOW " %d", file.name(), file.size());
                _SD_content.push_back(x_ps_strdup((const char*) _chbuf));
            }
        }
        if(isAudio(file)) _audioFilesInList++;
        if(endsWith(file.name(), ".m3u")) _audioFilesInList++;
    }
    for(int i = 0; i < _SD_content.size(); i++){  // easy bubble sort
        for(int j = 1; j < _SD_content.size(); j++){
            if(strcmp(_SD_content[j - 1], _SD_content[i]) > 0){
                swap(_SD_content[i], _SD_content[j - 1]);
            }
        }
    }
    for(int i = 0; i < _SD_content.size(); i++){
        if(_SD_content[i][0] == 2){ // remove ASCII 2
            memcpy(_SD_content[i], _SD_content[i] + 1, strlen(_SD_content[i]));
        }
    }
    audioFile.close();
    return true;
}

