schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
void showAudioFilesList(uint16_t fileListNr){ // on tft

    auto triangleUp   = [&](int16_t x, int16_t y, uint8_t s){tft.fillTriangle(x + s, y + 0, x +  0, y + 2*s, x + 2*s, y + 2*s , TFT_RED);};
    auto triangleDown = [&](int16_t x, int16_t y, uint8_t s){tft.fillTriangle(x + 0, y + 0, x + 2*s, y +  0, x +  s, y + 2*s , TFT_RED);};

    clearWithOutHeaderFooter();
    if(_SD_content.size() < 10) fileListNr = 0;
    showHeadlineItem(AUDIOFILESLIST);
    tft.setFont(_fonts[0]);
    uint8_t lineHight = _winWoHF.h / 10;
    tft.setTextColor(TFT_ORANGE);
    tft.writeText(_curAudioFolder.c_str(), 10, _winHeader.h,  _dispWidth - 10, lineHight, TFT_ALIGN_LEFT, true, true);
    tft.setTextColor(TFT_WHITE);
    for(uint8_t pos = 1; pos < 10; pos++){
        if(pos == 1 && fileListNr > 0){
            tft.setTextColor(TFT_AQUAMARINE);
            triangleUp(0, _winHeader.h + (pos * lineHight), lineHight / 3.5);
        }
        if(pos == 9 && fileListNr + 9 < _SD_content.size()){
            tft.setTextColor(TFT_AQUAMARINE);
            triangleDown(0, _winHeader.h + (pos * lineHight), lineHight / 3.5);
        }
        if(fileListNr + pos > _SD_content.size()) break;
        if(indexOf(_SD_content[pos + fileListNr - 1 ], "\033[", 0) == -1) tft.setTextColor(TFT_GRAY); // is folder
        else tft.setTextColor(TFT_WHITE);                                                             // is file
        tft.writeText(_SD_content[pos + fileListNr - 1 ], 20, _winFooter.h + (pos) * lineHight, _dispWidth - 20, lineHight, TFT_ALIGN_LEFT, true, true);
    }
    _timeCounter.timer = 10;
    _timeCounter.factor = 1.0;
}

boolean isAudio(File file){
    if(endsWith(file.name(), ".mp3") || endsWith(file.name(), ".aac") || endsWith(file.name(), ".m4a") || endsWith(file.name(), ".wav") ||
               endsWith(file.name(), ".flac") || endsWith(file.name(), ".opus") || endsWith(file.name(), ".ogg")){
        return true;
    }
    return false;
}

boolean isAudio(const char* path){
    if(endsWith(path, ".mp3") || endsWith(path, ".aac") || endsWith(path, ".m4a") || endsWith(path, ".wav") ||
               endsWith(path, ".flac") || endsWith(path, ".opus") || endsWith(path, ".ogg")){
        return true;
    }
    return false;
}

boolean isPlaylist(File file){
    if(endsWith(file.name(), ".m3u")){
        return true;
    }
    return false;
}

void processPlaylist(boolean first) {
    static uint16_t idx = 0;
    boolean f_has_EXTINF = false;
    if(first){
        boolean f_EXTINF_seen = false;
        _plsEntries = 0;
        idx = 0;
        vector_clear_and_shrink(_PLS_content);
        while(playlistFile.available() > 0) {
            size_t bytesRead = playlistFile.readBytesUntil('\n', _chbuf, 511);
            if(bytesRead < 5) continue; // line is # or space or nothing, smallest filename "1.mp3" < 5
            _chbuf[bytesRead] = '\0';
            trim(_chbuf);
            if(startsWith(_chbuf, "#EXTM3U")) continue;
            if(startsWith(_chbuf, "#EXTINF")) {_PLS_content.push_back(x_ps_strdup((const char*)_chbuf)); f_EXTINF_seen = true; continue;}
            if(startsWith(_chbuf, "http"))    {_PLS_content.push_back(x_ps_strdup((const char*)_chbuf)); f_EXTINF_seen = false; _plsEntries++; continue;}
            if(isAudio(_chbuf))               {_PLS_content.push_back(x_ps_strdup((const char*)_chbuf)); f_EXTINF_seen = false; _plsEntries++; continue;}
            if(f_EXTINF_seen == true) {_PLS_content.pop_back(); f_EXTINF_seen = false;}
            continue;
        }
        for(int i = 0; i < _PLS_content.size(); i++){
            strcpy(_chbuf, _PLS_content[i]);
            urldecode(_chbuf);
            SerialPrintfln("Playlist:    " ANSI_ESC_GREEN "%s", _chbuf);
        }
        if(_plsEntries == 0) return;
        _f_playlistEnabled = true;
        _plsMaxEntries = _plsEntries;
    }

    if(!_plsEntries) goto exit;

    // now read from vector _PLS_content

    strcpy(_chbuf, _PLS_content[idx]);
    if(startsWith(_chbuf, "#EXTINF")) {
        f_has_EXTINF = true;
        int8_t idx1 = indexOf(_chbuf, ":", 0) + 1;
        int8_t idx2 = indexOf(_chbuf, ",", 0);
        SerialPrintfln("Playlist:    " ANSI_ESC_GREEN "Title: %s", _chbuf + idx2 + 1);
        clearLogo();
        showFileName(_chbuf + idx2 + 1);
        int8_t len = idx2 - idx1;
        if(len > 0 && len < 6) { // song playtime
            char tmp[7];
            memcpy(tmp, _chbuf + idx1, len);
            tmp[len] = '\0';
            SerialPrintfln("Playlist:    " ANSI_ESC_GREEN "playtime: %is", atoi(tmp));
        }
        idx++;
        strcpy(_chbuf, _PLS_content[idx]);
    }

    _f_playlistNextFile = false;
    if(startsWith(_chbuf, "http")) {
        SerialPrintflnCut("Playlist:    ", ANSI_ESC_YELLOW, _chbuf);
        showVolumeBar();
        if(!f_has_EXTINF) clearLogoAndStationname();
        f_has_EXTINF = false;
        webSrv.send((String) "SD_playFile=" + _chbuf);
        changeState(PLAYERico);
        _cur_Codec = 0;
        _f_isWebConnected = audioConnecttohost(_chbuf);
        _f_isFSConnected = false;
        showFileNumber();
    }
    else {
        const char* path = playlistFile.path();
        int32_t         idx = lastIndexOf(path, '/');
        int32_t         len = strlen(_chbuf);
        for(int32_t i = len; i > -1; i--) { _chbuf[idx + i + 1] = _chbuf[i]; }
        strncpy(_chbuf, path, idx + 1);
        // log_w("pls path %s, %i, %i", _chbuf, idx, len);
        urldecode(_chbuf);
        SerialPrintfln("Playlist:    " ANSI_ESC_YELLOW "%s", _chbuf);
        webSrv.send((String) "SD_playFile=" + _chbuf);
        if(!f_has_EXTINF) {SD_playFile(_chbuf);}
        else              {f_has_EXTINF = false; SD_playFile(_chbuf, 0, false);}
    }

    idx++;
    _plsEntries--;
    return;

exit:
    playlistFile.close();
    _plsMaxEntries = 0;
    SerialPrintfln("Playlist:    " ANSI_ESC_BLUE "end of playlist");
    webSrv.send("SD_playFile=end of playlist");
    _f_playlistEnabled = false;
    changeState(PLAYER);
    return;
}
/*****************************************************************************************************************************************************
 *                                         C O N N E C T   TO   W I F I     /     A C C E S S P O I N T                                              *
 *****************************************************************************************************************************************************/
bool connectToWiFi() {
    String s_ssid = "", s_password = "", s_info = "";
    wifiMulti.addAP(_SSID, _PW);                        // SSID and PW in code
    if(pref.isKey("ap_ssid") && pref.isKey("ap_pw")) {  // exists?
        String ap_ssid = pref.getString("ap_ssid", ""); // credentials from accesspoint
        String ap_pw = pref.getString("ap_pw", "");
        if(ap_ssid.length() > 0 && ap_pw.length() > 0) wifiMulti.addAP(ap_ssid.c_str(), ap_pw.c_str());
    }
    WiFi.setHostname("MiniWebRadio");
    if(psramFound()) WiFi.useStaticBuffers(true);
    File file = SD_MMC.open("/networks.csv"); // try credentials given in "/networks.txt"
    if(file) {                                // try to read from SD_MMC
        String str = "";
        while(file.available()) {
            str = file.readStringUntil('\n');   // read the line
            if(str[0] == '*') continue;         // ignore this, goto next line
            if(str[0] == '\n') continue;        // empty line
            if(str[0] == ' ') continue;         // space as first char
            if(str.indexOf('\t') < 0) continue; // no tab
            str += "\t";
            uint p = 0, q = 0;
            s_ssid = "", s_password = "", s_info = "";
            for(int32_t i = 0; i < str.length(); i++) {
                if(str[i] == '\t') {
                    if(p == 0) s_ssid = str.substring(q, i);
                    if(p == 1) s_password = str.substring(q, i);
                    if(p == 2) s_info = str.substring(q, i);
                    p++;
                    i++;
                    q = i;
                }
            }
            // log_i("s_ssid=%s  s_password=%s  s_info=%s", s_ssid.c_str(), s_password.c_str(), s_info.c_str());
            if(s_ssid == "") continue;
            if(s_password == "") continue;
            wifiMulti.addAP(s_ssid.c_str(), s_password.c_str());
        }
        file.close();
    }
    wifiMulti.run();

    if(WiFi.isConnected()) {
        SerialPrintfln("WiFI_info:   Connecting WiFi...");
        WiFi.setSleep(false);
        if(!MDNS.begin("MiniWebRadio")) {
            SerialPrintfln("WiFI_info:   " ANSI_ESC_YELLOW "Error starting mDNS");
        }
        else{
            MDNS.addService("esp32", "tcp", 80);
            SerialPrintfln("WiFI_info:   mDNS name: " ANSI_ESC_CYAN "MiniWebRadio");
        }
        return true;
    }
    else {
        SerialPrintfln("WiFI_info:   " ANSI_ESC_RED "WiFi credentials are not correct");
        return false; // can't connect to any network
    }
}

void openAccessPoint() { // if credentials are not correct open AP at 192.168.4.1
    clearAll();
    tft.setFont(_fonts[4]);
    tft.setTextColor(TFT_YELLOW);
    setTFTbrightness(80);
    _f_accessPoint = true;
    WiFi.mode(WIFI_STA);
    WiFi.disconnect();
    WiFi.softAP("MiniWebRadio");
    IPAddress myIP = WiFi.softAPIP();
    String    AccesspointIP = myIP.toString();
    char buf[100];
    sprintf(buf, "WiFi credentials are not correct\nAccesspoint IP: " ANSI_ESC_CYAN "%s", AccesspointIP.c_str());
    tft.writeText(buf, 0, 0, _dispWidth, _dispHeight, TFT_ALIGN_LEFT, true, false);
    SerialPrintfln("Accesspoint: " ANSI_ESC_RED "IP: %s", AccesspointIP.c_str());
    int16_t n = WiFi.scanNetworks();
    if(n == 0) {
        SerialPrintfln("setup: ....  no WiFi networks found");
        while(true) { ; }
    }
    else {
        SerialPrintfln("setup: ....  %d WiFi networks found", n);
        for(int32_t i = 0; i < n; ++i) {
            SerialPrintfln("setup: ....  " ANSI_ESC_GREEN "%s (%d)", WiFi.SSID(i).c_str(), (int16_t)WiFi.RSSI(i));
            _scannedNetworks += WiFi.SSID(i) + '\n';
        }
    }
    webSrv.begin(80, 81); // HTTP port, WebSocket port
    return;
}

