schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
void SD_playFolder(const char* folderPath, bool showFN) {
    // Plays all audio files in a given folder. If the specified path is not a folder, the function aborts. Otherwise the first recording file is
    // searched for and called. The flag _f_playAllFiles is set. The next time you call it up, the path doesn't matter, the next audio file is called
    // up... etc. If no further audio file is found, the flag is reset and the function is aborted.
    int32_t idx = 0;
    static uint16_t cAFNr = 0;
    if(!_f_playAllFiles) {
        if(audioFile) audioFile.close(); // maybe audioFile contains old data
        _curAudioFolder = folderPath;
        _f_playAllFiles = true;
        cAFNr = _cur_AudioFileNr; // save and set it back at the end
        // log_w("_cur_AudioFileNr %i ", _cur_AudioFileNr + 1);
        _cur_AudioFileNr = 0;
        changeState(PLAYERico);
        showVolumeBar();
        SD_listDir(_curAudioFolder.c_str(), true, true);
        if(!_f_shuffle){sprintf(_chbuf, "%s/%s", _curAudioFolder.c_str() ,_SD_content[_cur_AudioFileNr]);}
        else{
            SerialPrintfln("AUDIO_info:  " ANSI_ESC_GREEN "%s", "shuffle audio files");
            xchgShuffle(_SD_content.size());
            sprintf(_chbuf, "%s/%s", _curAudioFolder.c_str() ,_SD_content[_shuffleArray[_cur_AudioFileNr]]);
        }
        if(indexOf(_chbuf, ".m3u", 0) > 0) {SerialPrintfln("AUDIO_info:  " ANSI_ESC_YELLOW "skip playlist %s", _chbuf); return;} // no playlist allowed here
        idx = indexOf(_chbuf, "\033[", 1);
        _chbuf[idx] = '\0';  // remove color and filesize
        SD_playFile(_chbuf, 0, showFN);
        memmove(_chbuf + 14, _chbuf, strlen(_chbuf) + 1);
        memcpy(_chbuf, "SD_playFolder=", 14);
        webSrv.send(_chbuf);
        return;
    }
    if(_cur_AudioFileNr + 1 == _SD_content.size()){
        _f_playAllFiles = false;
        SerialPrintfln("AUDIO_info:  " ANSI_ESC_CYAN "No other audio files found");
        webSrv.send("SD_playFolder=No other audio files found");
        _cur_AudioFileNr = cAFNr;
        _f_shuffle = false;
        changeState(PLAYER);
        stopSong();
        return;
    }
    _cur_AudioFileNr++;
    if(!_f_shuffle){sprintf(_chbuf, "%s/%s", _curAudioFolder.c_str() ,_SD_content[_cur_AudioFileNr]);}
    else{sprintf(_chbuf, "%s/%s", _curAudioFolder.c_str() ,_SD_content[_shuffleArray[_cur_AudioFileNr]]);}
    if(indexOf(_chbuf, ".m3u", 0) > 0) {SerialPrintfln("AUDIO_info:  " ANSI_ESC_YELLOW "skip playlist %s", _chbuf); return;} // no playlist allowed here
    idx = indexOf(_chbuf, "\033[", 1);
    _chbuf[idx] = '\0';  // remove color and filesize
    SD_playFile(_chbuf, 0, showFN);
    memmove(_chbuf + 14, _chbuf, strlen(_chbuf) + 1);
    memcpy(_chbuf, "SD_playFolder=", 14);
    webSrv.send(_chbuf);
    return;
}

bool SD_rename(const char* src, const char* dest) {
    bool success = false;
    if(SD_MMC.exists(src)) {
        log_i("exists");
        success = SD_MMC.rename(src, dest);
    }
    return success;
}

bool SD_newFolder(const char* folderPathName) {
    bool success = false;
    success = SD_MMC.mkdir(folderPathName);
    return success;
}

bool SD_delete(const char* itemPath) {
    bool success = false;
    if(SD_MMC.exists(itemPath)) {
        File dirTest = SD_MMC.open(itemPath, "r");
        bool isDir = dirTest.isDirectory();
        dirTest.close();
        if(isDir) success = SD_MMC.rmdir(itemPath);
        else
            success = SD_MMC.remove(itemPath);
    }
    return success;
}

void headphoneDetect() { // called via interrupt
    _f_hpChanged = true;
}

void fall_asleep() {
    xSemaphoreTake(mutex_display, portMAX_DELAY);
    _f_sleeping = true;
    _f_playlistEnabled = false;
    _f_isFSConnected = false;
    _f_isWebConnected = false;
    playlistFile.close();
    if(_state == A2DP_SINK){_state = UNDEFINED; a2dp_sink_deinit();}
    else{                   audioStopSong();}
    if(_state != CLOCK) {
        clearAll();
        setTFTbrightness(0);
    }
    xSemaphoreGive(mutex_display);
    WiFi.disconnect(true);  // Disconnect from the network
    vTaskDelay(300);
    WiFi.mode(WIFI_OFF);    // Switch WiFi off
    setCpuFrequencyMhz(80); // 10MHz and 40MHz seem to stop TPanel after minute or so.
    if(_state == CLOCKico) _state = CLOCK;
    if(_state == RADIOico) _state = RADIO;
    if(_state == PLAYERico) _state = PLAYER;
    SerialPrintfln("falling asleep");
}

void wake_up() {
    if(_f_sleeping == true || _f_eof_alarm) { // awake
        _f_sleeping = false;
        setCpuFrequencyMhz(240);
        SerialPrintfln("awake");
        _f_mute = true;
        mute();
        clearAll();
        setTFTbrightness(_brightness);
        WiFi.disconnect(false); // Reconnect the network
        wifiMulti.run();
        Serial.print("START WIFI   ");
        while(WiFi.status() != WL_CONNECTED) {
            delay(100);
            Serial.print(".");
        }
        Serial.println("");
        SerialPrintfln("WiFi connected");
        if(_state == A2DP_SINK || _state == UNDEFINED) {
            changeState(RADIO);
            showFooter();
            showHeadlineTime();
            showHeadlineVolume();
               return;
        }
        connecttohost(_lastconnectedhost.c_str());
        showFooter();
        showHeadlineTime();
        showHeadlineVolume();
        if(_state == CLOCK) {
            showHeadlineItem(CLOCK);
            display_time(true);
        }
        else {
            changeState(RADIO);
            showVUmeter();
            showLogoAndStationName();
            showHeadlineItem(RADIO);
        }
    }
}

void setRTC(const char* TZString) {
    rtc.stop();
    _f_rtc = rtc.begin(_TZString.c_str());
    if(!_f_rtc) {
        SerialPrintfln(ANSI_ESC_RED "connection to NTP failed, trying again");
        ESP.restart();
    }
}

void vector_clear_and_shrink(vector<char*>&vec){
    uint size = vec.size();
    for (int32_t i = 0; i < size; i++) {
        if(vec[i]){
            free(vec[i]);
            vec[i] = NULL;
        }
    }
    vec.clear();
    vec.shrink_to_fit();
}

void dlna_items_vector_clear_ans_shrink(){
    vector_clear_and_shrink(_dlna_items.name);
    vector_clear_and_shrink(_dlna_items.id);
    vector_clear_and_shrink(_dlna_items.uri);
    _dlna_items.size.clear();
    _dlna_items.isDir.clear();
    _dlna_items.isAudio.clear();
}

