schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
boolean copySDtoFFat(const char* path){
    if(!_f_FFatFound) return false;
    uint8_t buffer[1024];
    size_t r = 0, w = 0;
    size_t len = 0;
    File file1 = SD_MMC.open(path, "r");
    File file2 = FFat.open(path, "w");
    while(true){
        r = file1.read(buffer, 1024);
        w = file2.write(buffer, r);
        if(r != w){
            file1.close();
            file2.close();
            FFat.remove(path);
            return false;
        }
        len += r;
        if(r == 0) break;
    }
    log_i("file length %i, written %i", file1.size(), len);
    if(file1.size() == len) return true;
    return false;
}

/*****************************************************************************************************************************************************
 *                                                            M E N U E / B U T T O N S                                                              *
 *****************************************************************************************************************************************************/
// clang-format off
void changeState(int32_t state){
    if(state == _state) return;  //nothing todo
    _f_state_isChanging = true;
    _f_volBarVisible = false;
    if(_timeCounter.timer){
        _timeCounter.timer = 0;
        showFooterRSSI(true);
    }
    switch(state) {
        case RADIO:{
            showHeadlineItem(RADIO);
            if(_state == RADIOico || _state == RADIOmenue){
                _f_newStreamTitle = true;
            }
            else if(_state == PLAYER  || _state == PLAYERico || _state == DLNA){
                setStation(_cur_station);
                clearTitle();
                showLogoAndStationName();
                _f_newStreamTitle = true;
            }
            else if(_state == CLOCKico){
                showLogoAndStationName();
                _timeCounter.timer = 0;
                _f_newStreamTitle = true;
            }
            else if(_state == SLEEP){
                clearLogoAndStationname();
                clearTitle();
                connecttohost(_lastconnectedhost.c_str());
                showLogoAndStationName();
                showFooter();
                showHeadlineVolume();
            }
            else if(_state == BRIGHTNESS){
                showLogoAndStationName();
                _f_newStreamTitle = true;
                clearTitle();
            }
            else if(_state == STATIONSLIST){
                clearWithOutHeaderFooter();
                showLogoAndStationName();
                showStreamTitle(_streamTitle);
            }
            else if(_state == A2DP_SINK || _state == UNDEFINED){
                audioInit();
                audioSetVolume(_cur_volume);
                clearWithOutHeaderFooter();
                connecttohost(_lastconnectedhost.c_str());
                showLogoAndStationName();
                showStreamTitle(_streamTitle);
            }
            else{
                showLogoAndStationName();
                _f_newStreamTitle = true;
            }
            showVUmeter();
            webSrv.send("changeState=RADIO");
            break;
        }
        case RADIOico:{
            showHeadlineItem(RADIOico);
            _pressBtn[0] = "/btn/Button_Mute_Yellow.jpg";        _releaseBtn[0] =  _f_mute? "/btn/Button_Mute_Red.jpg":"/btn/Button_Mute_Green.jpg";
            _pressBtn[1] = "/btn/Button_Volume_Down_Yellow.jpg"; _releaseBtn[1] = "/btn/Button_Volume_Down_Blue.jpg";
            _pressBtn[2] = "/btn/Button_Volume_Up_Yellow.jpg";   _releaseBtn[2] = "/btn/Button_Volume_Up_Blue.jpg";
            _pressBtn[3] = "/btn/Button_Previous_Yellow.jpg";    _releaseBtn[3] = "/btn/Button_Previous_Green.jpg";
            _pressBtn[4] = "/btn/Button_Next_Yellow.jpg";        _releaseBtn[4] = "/btn/Button_Next_Green.jpg";
            _pressBtn[5] = "/btn/Button_List_Yellow.jpg";        _releaseBtn[5] = "/btn/Button_List_Green.jpg";
            _pressBtn[6] = "/btn/Black.jpg";                     _releaseBtn[6] = "/btn/Black.jpg";
            _pressBtn[7] = "/btn/Black.jpg";                     _releaseBtn[7] = "/btn/Black.jpg";
            clearTitle();
            showVolumeBar();
            //for(int32_t i = 0; i < 8 ; i++) {drawImage(_releaseBtn[i], i * _winButton.w, _winButton.y);}
            if(_f_mute) drawImage("/btn/RADIOico2.gif", 0, _winButton.y);
            else        drawImage("/btn/RADIOico1.gif", 0, _winButton.y);
            _timeCounter.timer = 5;
            _timeCounter.factor = 2.0;
            break;
        }
        case RADIOmenue:{
            showHeadlineItem(RADIOmenue);
            _pressBtn[0] = "/btn/MP3_Yellow.jpg";                _releaseBtn[0] = "/btn/MP3_Green.jpg";
            _pressBtn[1] = "/btn/Button_DLNA_Yellow.jpg";        _releaseBtn[1] = "/btn/Button_DLNA_Green.jpg";
            _pressBtn[2] = "/btn/Clock_Yellow.jpg";              _releaseBtn[2] = "/btn/Clock_Green.jpg";
            _pressBtn[3] = "/btn/Button_Sleep_Yellow.jpg";       _releaseBtn[3] = "/btn/Button_Sleep_Green.jpg";
            if(TFT_BL != -1){
                _pressBtn[4]="/btn/Bulb_Yellow.jpg";             _releaseBtn[4]="/btn/Bulb_Green.jpg";
            }
            else{
                _pressBtn[4]="/btn/Black.jpg";                   _releaseBtn[4]="/btn/Black.jpg";
            }
            #if CONFIG_IDF_TARGET_ESP32
                _pressBtn[5] = "/btn/BT_Yellow.jpg";             _releaseBtn[5] = "/btn/BT_Green.jpg";
            #else
                _pressBtn[5] = "/btn/Black.jpg";                 _releaseBtn[5] = "/btn/Black.jpg";
            #endif
            _pressBtn[6] = "/btn/Black.jpg";                     _releaseBtn[6] = "/btn/Black.jpg";
            _pressBtn[7] = "/btn/Black.jpg";                     _releaseBtn[7] = "/btn/Black.jpg";
            // for(int32_t i = 0; i < 8 ; i++) {drawImage(_releaseBtn[i], i * _winButton.w, _winButton.y);}
            drawImage("/btn/RADIOmenue.gif", 0, _winButton.y);
            if(TFT_BL == -1){
                drawImage(_releaseBtn[4], 4 * _winButton.w, _winButton.y);
            }
            #if CONFIG_IDF_TARGET_ESP32
                drawImage(_releaseBtn[5], 5 * _winButton.w, _winButton.y);
            #endif
            clearVolBar();
            _timeCounter.timer = 5;
            _timeCounter.factor = 2.0;
            break;
        }
        case STATIONSLIST:{
            showStationsList(_staListNr);
            _timeCounter.timer = 10;
            _timeCounter.factor = 1.0;
            break;
        }
        case CLOCK:{
            if(_state == ALARM){
                updateSettings();
                const char day[7][6] = {"Sun, ", "Mon, ", "Tue, ", "Wed, ", "Thu, ", "Fri, ", "Sat, "};
                char wd[40] = "";
                for(uint8_t i = 0; i < 7; i++){
                    uint8_t j = 1 << i;
                    if(_alarmdays & j) strcat(wd, day[i]);
                }
                uint8_t l = strlen(wd);
                if(l > 1) wd[l - 2] = '\0'; // remove last space and comma
                else strcat(wd, "no day of the week activated");

