schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
            if(_alarmtime == rtc.getMinuteOfTheDay() && _state != ALARM) { // is alarmtime?
                SerialPrintfln("is alarmtime");
                if((_alarmdays >> rtc.getweekday()) & 1) {                 // is alarmday? 0-Sun, 1-Mon, 2 Tue ....
                    if(!_f_semaphore) {
                        _f_alarm = true;
                        _f_semaphore = true;
                    } // set alarmflag
                }
            }
            else
                _f_semaphore = false;

            if(_f_alarm) {
                clearAll();
                if(_state == A2DP_SINK){a2dp_sink_deinit(); audioInit(); _state = UNDEFINED;}
                showFileName("ALARM");
                drawImage("/common/Alarm.jpg", _winLogo.x, _winLogo.y);
                setTFTbrightness(_brightness);
                SerialPrintfln(ANSI_ESC_MAGENTA "Alarm");
                _f_alarm = false;
                connecttoFS("/ring/alarm_clock.mp3");
                audioSetVolume(21);
            }
            if(_f_hpChanged) {
                setVolume(_cur_volume);
                if(!digitalRead(HP_DETECT)) { SerialPrintfln("Headphone plugged in"); }
                else { SerialPrintfln("Headphone unplugged"); }
                _f_hpChanged = false;
            }
        }
        if(_commercial_dur > 0) {
            _commercial_dur--;
            if((_commercial_dur == 2) && (_state == RADIO)) clearStreamTitle(); // end of commercial? clear streamtitle
        }
        if(_f_newStreamTitle && !_timeCounter.timer) {
            _f_newStreamTitle = false;
            if(_state == RADIO) {
                if(strlen(_streamTitle)) showStreamTitle(_streamTitle);
                else if(strlen(_icyDescription)) {
                    showStreamTitle(_icyDescription);
                    _f_newIcyDescription = false;
                    webSrv.send((String) "icy_description=" + _icyDescription);
                }
                else
                    clearStreamTitle();
            }
            webSrv.send((String) "streamtitle=" + _streamTitle);
        }
        if(_f_newIcyDescription && !_timeCounter.timer) {
            if(_state == RADIO) {
                if(!strlen(_streamTitle)) showStreamTitle(_icyDescription);
            }
            webSrv.send((String) "icy_description=" + _icyDescription);
            _f_newIcyDescription = false;
        }

        if(_f_newCommercial && !_timeCounter.timer) {
            if(_state == RADIO) { showStreamTitle(_commercial); }
            webSrv.send((String) "streamtitle=" + _commercial);
            _f_newCommercial = false;
        }

        if(_cur_Codec == 0) {
            uint8_t c = audioGetCodec();
            if(c != 0 && c != 8 && c < 10) { // unknown or OGG, guard: c {1 ... 7, 9}
                _cur_Codec = c;
                SerialPrintfln("Audiocodec:  " ANSI_ESC_YELLOW "%s", codecname[c]);
                if(_state == PLAYER || _state == PLAYERico) showFileLogo(_state);
                if(_state == RADIO && _f_logoUnknown == true) {
                    _f_logoUnknown = false;
                    showFileLogo(_state);
                }
            }
        }

        if(_f_isFSConnected) {
            //    uint32_t t = 0;
            //    uint32_t fs = audioGetFileSize();
            //    uint32_t br = audioGetBitRate();
            //    if(br) t = (fs * 8)/ br;
            //    log_w("Br %d, Dur %ds", br, t);
        }
        if(_state == A2DP_SINK){ // update BT RSSI
            showFooterRSSI_bt(_rssi_bt);
            bt_av_get_last_RSSI_delta();
        }
    }

    if(_f_10sec == true) {
        _f_10sec = false;
        if(_state == RADIO && !_icyBitRate && !_f_sleeping) {
            uint32_t ibr = audioGetBitRate() / 1000;
            if(ibr > 0) {
                if(ibr != _avrBitRate) {
                    _avrBitRate = ibr;
                    showFooterBitRate(_avrBitRate);
                }
            }
        }
        updateSettings();
    }

    if(_f_1min == true) {
        _f_1min = false;
        updateSleepTime();
    }

    if(_f_clearLogo){
        clearLogo();
        _f_clearLogo = false;
    }

    if(_f_clearStationName){
        clearStationName();
        _f_clearStationName = false;
    }

    if(_f_playlistEnabled) {
        if(!_f_playlistNextFile) {
            if(!audioIsRunning() && !_f_pauseResume && !_f_isFSConnected) {
                SerialPrintfln("AUDIO_info:  " ANSI_ESC_GREEN "next playlist file");
                processPlaylist(false);
                _playlistTime = millis();
                _f_playlistNextFile = true;
            }
        }
        else {
            if(_playlistTime + 5000 < millis()) _f_playlistNextFile = false;
        }
    }

    if(_f_playAllFiles){
        if(!audioIsRunning() && !_f_pauseResume && !_f_isFSConnected){
            SerialPrintfln("AUDIO_info:  " ANSI_ESC_GREEN "next audio file");
            SD_playFolder("", true);
        }
    }

    if(_f_BTstateChanged){ // BT connected to disconnected and vice versa
        if(_state == A2DP_SINK) showFileLogo(_state);
        if(_f_BTconnected == false) showFooterRSSI_bt(-100);
        _f_BTstateChanged = false;
    }
}
/*****************************************************************************************************************************************************
 *                                                                    E V E N T S                                                                    *
 *****************************************************************************************************************************************************/
// Events from audioI2S library
void audio_info(const char* info) {
    if(startsWith(info, "Request")) {
        SerialPrintflnCut("AUDIO_info:  ", ANSI_ESC_RED, info);
        return;
    }
    if(startsWith(info, "FLAC")) {
        SerialPrintflnCut("AUDIO_info:  ", ANSI_ESC_GREEN, info);
        return;
    }
    if(endsWith(info, "Stream lost")) {
        SerialPrintflnCut("AUDIO_info:  ", ANSI_ESC_RED, info);
        return;
    }
    if(startsWith(info, "authent")) {
        SerialPrintflnCut("AUDIO_info:  ", ANSI_ESC_GREEN, info);
        return;
    }
    if(startsWith(info, "StreamTitle=")) { return; }
    if(startsWith(info, "HTTP/") && info[9] > '3') {
        SerialPrintflnCut("AUDIO_info:  ", ANSI_ESC_RED, info);
        return;
    }
    if(CORE_DEBUG_LEVEL >= ARDUHAL_LOG_LEVEL_WARN) // all other
    {
        SerialPrintflnCut("AUDIO_info:  ", ANSI_ESC_GREEN, info);
        // SerialPrintfln("AUDIO_info:  " ANSI_ESC_GREEN "%s", info);
        return;
    }
}
//----------------------------------------------------------------------------------------------------------------------------------------------------
void audio_showstation(const char* info) {
    _stationName_air = info;
    if(strlen(info)) SerialPrintfln("StationName: " ANSI_ESC_MAGENTA "%s", info);
    if(!_cur_station) _f_newLogoAndStation = true;
}
//----------------------------------------------------------------------------------------------------------------------------------------------------
void audio_showstreamtitle(const char* info) {
    strcpy(_streamTitle, info);
    if(!_f_irNumberSeen) _f_newStreamTitle = true;
    SerialPrintfln("StreamTitle: " ANSI_ESC_YELLOW "%s", info);
}
//----------------------------------------------------------------------------------------------------------------------------------------------------
void show_ST_commercial(const char* info) {
    _commercial_dur = atoi(info) / 1000; // info is the duration of advertising in ms
    char cdur[10];
    itoa(_commercial_dur, cdur, 10);
    if(_f_newCommercial) return;
    strcpy(_commercial, "Advertising: ");
    strcat(_commercial, cdur);
    strcat(_commercial, "s");
    _f_newCommercial = true;
    SerialPrintfln("StreamTitle: %s", info);
}
void audio_commercial(const char* info) { show_ST_commercial(info); }
//----------------------------------------------------------------------------------------------------------------------------------------------------
void audio_eof_mp3(const char* info) { // end of mp3 file (filename)
    if(startsWith(info, "alarm")) _f_eof_alarm = true;
    SerialPrintflnCut("end of file: ", ANSI_ESC_YELLOW, info);
    if(_state == PLAYER || _state == PLAYERico) {
        if(!_f_playAllFiles && ! _f_playlistEnabled){
            _f_clearLogo = true;
            _f_clearStationName = true;
        }
    }
    webSrv.send("SD_playFile=end of audiofile");
    _f_eof = true;
    _f_isFSConnected = false;
}
//----------------------------------------------------------------------------------------------------------------------------------------------------
void audio_eof_stream(const char* info) {
    _f_isWebConnected = false;
    SerialPrintflnCut("end of file: ", ANSI_ESC_YELLOW, info);
    if(_state == PLAYER || _state == PLAYERico) {
        if(!_f_playAllFiles && ! _f_playlistEnabled){
            _f_clearLogo = true;
            _f_clearStationName = true;
        }
    }
    _f_eof = true;
    _f_isWebConnected = false;
}
//----------------------------------------------------------------------------------------------------------------------------------------------------
void audio_lasthost(const char* info) { // really connected URL
    if(_f_playlistEnabled) return;
    _lastconnectedhost = info;
    SerialPrintflnCut("lastURL: ..  ", ANSI_ESC_WHITE, _lastconnectedhost.c_str());
    webSrv.send("stationURL=" + _lastconnectedhost);
}
//----------------------------------------------------------------------------------------------------------------------------------------------------
void audio_icyurl(const char* info) { // if the Radio has a homepage, this event is calling
    if(strlen(info) > 5) {
        SerialPrintflnCut("icy-url: ..  ", ANSI_ESC_WHITE, info);
        _homepage = String(info);
        if(!_homepage.startsWith("http")) _homepage = "http://" + _homepage;
    }
}
//----------------------------------------------------------------------------------------------------------------------------------------------------
void audio_id3data(const char* info) { SerialPrintfln("id3data: ..  " ANSI_ESC_GREEN "%s", info); }
//----------------------------------------------------------------------------------------------------------------------------------------------------
void audio_id3image(File& audiofile, const size_t APIC_pos, const size_t APIC_size){
    SerialPrintfln("CoverImage:  " ANSI_ESC_GREEN "Position %i, Size %i bytes", APIC_pos, APIC_size);
}
//----------------------------------------------------------------------------------------------------------------------------------------------------
void audio_icydescription(const char* info) {
    strcpy(_icyDescription, info);
    _f_newIcyDescription = true;
    if(strlen(info)) SerialPrintfln("icy-descr:   %s", info);
}
//----------------------------------------------------------------------------------------------------------------------------------------------------
void audio_bitrate(const char* info) {
    if(!strlen(info)) return; // guard
    _icyBitRate = str2int(info) / 1000;
    _f_newBitRate = true;
    SerialPrintfln("bitRate:     " ANSI_ESC_CYAN "%iKbit/s", _icyBitRate);
}
//----------------------------------------------------------------------------------------------------------------------------------------------------
void ftp_debug(const char* info) {
    if(startsWith(info, "File Name")) return;
    SerialPrintfln("ftpServer:   %s", info);
}
//----------------------------------------------------------------------------------------------------------------------------------------------------
void RTIME_info(const char* info) { SerialPrintfln("rtime_info:  %s", info); }

// Events from tft library
void tft_info(const char* info) { SerialPrintfln("tft_info: .  %s", info); }

void ir_code(uint8_t addr, uint8_t cmd) {
    SerialPrintfln("ir_code: ..  " ANSI_ESC_YELLOW "IR address " ANSI_ESC_BLUE "0x%02x, " ANSI_ESC_YELLOW "IR command " ANSI_ESC_BLUE "0x%02x", addr,
                   cmd);
    char buf[20];
    sprintf(buf, "IR_address=0x%02x", addr);
    webSrv.send(buf);
    sprintf(buf, "IR_command=0x%02x", cmd);
    webSrv.send(buf);
}
//----------------------------------------------------------------------------------------------------------------------------------------------------
// Events from IR Library
void ir_res(uint32_t res) {
    _f_irNumberSeen = false;
    if(_state != RADIO) return;
    if(_f_sleeping == true) return;
    tft.fillRect(_winLogo.x, _winLogo.y, _dispWidth, _winName.h + _winTitle.h, TFT_BLACK);
    SerialPrintfln("ir_result:   " ANSI_ESC_YELLOW "Stationnumber " ANSI_ESC_BLUE "%lu", (long unsigned)res);
    if(res != 0) {setStation(res);} // valid between 1 ... 999
    else         {setStation(_cur_station);}
    showVUmeter();
    return;
}
void ir_number(uint16_t num) {
    if(_state != RADIO) return;
    if(_f_sleeping) return;
    _f_irNumberSeen = true;
    tft.fillRect(_winLogo.x, _winLogo.y, _dispWidth, _winName.h + _winTitle.h, TFT_BLACK);
    tft.setFont(_fonts[8]);
    tft.setTextColor(TFT_GOLD);
    char buf[10];
    itoa(num, buf, 10);
    tft.writeText(buf, 0, _irNumber_y, _dispWidth, _dispHeight, TFT_ALIGN_CENTER, false, true);
}
void ir_key(uint8_t key) {
    if(_f_sleeping == true && key != 10) return;
    if(_f_sleeping == true && key == 10) {wake_up(); return;} // awake

    switch(key) {
        case 15:
            if(_state == SLEEP) {updateSleepTime(true); changeState(RADIO); break;} // CLOCK <-> RADIO
            if(_state == RADIO) {changeState(CLOCK); break;}
            if(_state == CLOCK) {changeState(RADIO); break;}
            break;
        case 11:
            upvolume(); // VOLUME+
            break;
        case 12:
            downvolume(); // VOLUME-
            break;
        case 14:
            if(_state == RADIO) {nextStation(); break;} // NEXT STATION
            if(_state == CLOCK) {nextStation(); changeState(RADIO); _f_switchToClock = true; break;}
            if(_state == SLEEP) {display_sleeptime(1); break;}
            break;
        case 13:
            if(_state == RADIO) {prevStation(); break;} // PREV STATION
            if(_state == CLOCK) {prevStation(); changeState(RADIO); _f_switchToClock = true; break;}
            if(_state == SLEEP) {display_sleeptime(-1); break;}
            break;
        case 10:
            mute(); break; // MUTE
        case 16:
            if(_state == RADIO) {changeState(SLEEP); break;} // OFF TIMER
            if(_state == SLEEP) {changeState(RADIO); break;}
            break;
        default: break;
    }
}
void ir_long_key(int8_t key) {
    log_i("long pressed key nr: %i", key);
    if(key == 10) fall_asleep(); // long mute
}
//----------------------------------------------------------------------------------------------------------------------------------------------------
// Event from TouchPad
// clang-format off
void tp_pressed(uint16_t x, uint16_t y) {
    // SerialPrintfln("tp_pressed, state is: %i", _state);
    //  SerialPrintfln(ANSI_ESC_YELLOW "Touchpoint  x=%d, y=%d", x, y);
    enum : int8_t {none = -1,  RADIO_1, RADIOico_1, RADIOico_2, RADIOmenue_1, PLAYER_1, PLAYERico_1, ALARM_1, BRIGHTNESS_1, CLOCK_1,
                               CLOCKico_1, ALARM_2, SLEEP_1, DLNA_1, DLNAITEMSLIST_1, STATIONSLIST_1, AUDIOFILESLIST_1, A2DP_SINK_1
    };
    int8_t yPos = none;
    int8_t btnNr = none;     // buttonnumber

