schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
    if(_f_sleeping) return;  // awake in tp_released()

    switch(_state) {
        case RADIO:
            if(y <= _winTitle.y) { yPos = RADIO_1; }
            break;
        case RADIOico:
            if(y <= _winTitle.y) { yPos = RADIOico_1; }
            if((y > _winButton.y) && (y < _winButton.y + _winButton.h)) {
                yPos = RADIOico_2;
                btnNr = x / _winButton.w;
            }
            break;
        case RADIOmenue:
            if((y > _winButton.y) && (y < _winButton.y + _winButton.h)) {
                yPos = RADIOmenue_1;
                btnNr = x / _winButton.w;
            }
            break;
        case PLAYER:
            if((y > _winButton.y) && (y < _winButton.y + _winButton.h)) {
                yPos = PLAYER_1;
                btnNr = x / _winButton.w;
            }
            break;
        case PLAYERico:
            if((y > _winButton.y) && (y < _winButton.y + _winButton.h)) {
                yPos = PLAYERico_1;
                btnNr = x / _winButton.w;
            }
            break;
        case CLOCK:
            if(_winDigits.y <= y && y <= _winDigits.y + _winDigits.h) { yPos = CLOCK_1; }
            break;
        case CLOCKico:
            if((y > _winButton.y) && (y < _winButton.y + _winButton.h)) {
                yPos = CLOCKico_1;
                btnNr = x / _winButton.w;
            }
            break;
        case ALARM:
            if(_winAlarmDays.y <= y && y <= _winAlarmDays.y + _winAlarmDays.h) {
                yPos = ALARM_1;
                btnNr = (x - 2) / _alarmdays_w;
            }  // weekdays
            if((y > _winButton.y) && (y < _winButton.y + _winButton.h)) {
                yPos = ALARM_2;
                btnNr = x / _winButton.w;
            }
            break;
        case SLEEP:
            if((y > _winButton.y) && (y < _winButton.y + _winButton.h)) {
                yPos = SLEEP_1;
                btnNr = x / _winButton.w;
            }
            break;
        case BRIGHTNESS:
            if((y > _winButton.y) && (y < _winButton.y + _winButton.h)) {
                yPos = BRIGHTNESS_1;
                btnNr = x / _winButton.w;
            }
            break;
        case DLNA:
            if((y > _winButton.y) && (y < _winButton.y + _winButton.h)) {
                yPos = DLNA_1;
                btnNr = x / _winButton.w;
            }
            break;
        case STATIONSLIST:
            if(y -_winHeader.h >= 0 && y -_winHeader.h <= _winWoHF.h){
                btnNr = (y -_winHeader.h)  / (_winWoHF.h / 10);
                yPos = STATIONSLIST_1;
            }
            else if(y > _winFooter.y){
                if(x > _winRSSID.x && x < (_winRSSID.x + _winRSSID.w)){
                    yPos = STATIONSLIST_1;
                    btnNr = 100;
                }
            }
            break;
        case AUDIOFILESLIST:
            if(y -_winHeader.h >= 0 && y -_winHeader.h <= _winWoHF.h){
                btnNr = (y -_winHeader.h)  / (_winWoHF.h / 10);
                yPos = AUDIOFILESLIST_1;
            }
            else if(y > _winFooter.y){
                if(x > _winRSSID.x && x < (_winRSSID.x + _winRSSID.w)){
                    yPos = AUDIOFILESLIST_1;
                    btnNr = 100;
                }
            }
            break;
        case DLNAITEMSLIST:
            if(y -_winHeader.h >= 0 && y -_winHeader.h <= _winWoHF.h){
                btnNr = (y -_winHeader.h)  / (_winWoHF.h / 10);
                yPos = DLNAITEMSLIST_1;
            }
            break;
        case A2DP_SINK:
            if((y > _winButton.y) && (y < _winButton.y + _winButton.h)) {
                yPos = A2DP_SINK_1;
                btnNr = x / _winButton.w;
            }
            break;
        default:
            break;
    }
    if(yPos == none) {
        SerialPrintfln(ANSI_ESC_YELLOW "Touchpoint not valid x=%d, y=%d", x, y);
        return;
    }

    switch(yPos){
        case RADIO_1:       changeState(RADIOico); break;
        case RADIOico_1:    changeState(RADIOmenue); break;
        case CLOCK_1:       changeState(CLOCKico);   break;
        case RADIOico_2:    if     (btnNr == 0){_releaseNr =  0; _timeCounter.timer = 5; mute();}
                            else if(btnNr == 1){_releaseNr =  1; _timeCounter.timer = 5;} // Vol-
                            else if(btnNr == 2){_releaseNr =  2; _timeCounter.timer = 5;} // Vol+
                            else if(btnNr == 3){_releaseNr =  3; _timeCounter.timer = 5;} // station--
                            else if(btnNr == 4){_releaseNr =  4; _timeCounter.timer = 5;} // station++
                            else if(btnNr == 5){_releaseNr =  5; } // list stations
                            else   {SerialPrintfln(ANSI_ESC_YELLOW "invalid button nr: %i", btnNr); break;}
                            changeBtn_pressed(btnNr);
                            break;
        case RADIOmenue_1:  if(btnNr == 0){_releaseNr = 10; audioStopSong();} // AudioPlayer
                            if(btnNr == 1){_releaseNr = 11;} // DLNA
                            if(btnNr == 2){_releaseNr = 12;} // Clock
                            if(btnNr == 3){_releaseNr = 13;} // Sleep
                            if(TFT_BL != -1){
                                if(btnNr == 4){_releaseNr = 14;} // Brightness
                            }
                            # if CONFIG_IDF_TARGET_ESP32 == 1
                                if(btnNr == 5){_releaseNr = 15;} // A2DP Sink
                            #endif
                            changeBtn_pressed(btnNr); break;
        case CLOCKico_1:    if(btnNr == 0){_releaseNr = 20;} // Bell
                            if(btnNr == 1){_releaseNr = 21;} // Radio
                            if(btnNr == 2){_releaseNr = 22; _timeCounter.timer = 5; mute();}
                            if(btnNr == 3){_releaseNr = 23; _timeCounter.timer = 5;} // Vol-
                            if(btnNr == 4){_releaseNr = 24; _timeCounter.timer = 5;} // Vol+
                            changeBtn_pressed(btnNr); break;
        case ALARM_2:       if(btnNr == 0){_releaseNr = 30;} // left
                            if(btnNr == 1){_releaseNr = 31;} // right
                            if(btnNr == 2){_releaseNr = 32;} // up
                            if(btnNr == 3){_releaseNr = 33;} // down
                            if(btnNr == 4){_releaseNr = 34;} // ready (return to CLOCK)
                            changeBtn_pressed(btnNr); break;
        case PLAYER_1:      if(btnNr == 0){_releaseNr = 40;} // previous audiofile
                            if(btnNr == 1){_releaseNr = 41;} // next audiofile
                            if(btnNr == 2){_releaseNr = 42;} // ready
                            if(btnNr == 3){_releaseNr = 43;} // play all files
                            if(btnNr == 4){_releaseNr = 44;} // play all files with shuffle
                            if(btnNr == 5){_releaseNr = 45;} // unused
                            if(btnNr == 6){_releaseNr = 46;} // audiofiles list
                            if(btnNr == 7){_releaseNr = 47;} // RADIO
                            changeBtn_pressed(btnNr); break;
        case PLAYERico_1:   if(btnNr == 0){_releaseNr = 50; mute();}
                            if(btnNr == 1){_releaseNr = 51;} // Vol-
                            if(btnNr == 2){_releaseNr = 52;} // Vol+
                            if(btnNr == 3){_releaseNr = 53;} // pause/resume
                            if(btnNr == 4){_releaseNr = 54;} // cancel
                            if(btnNr == 5){_releaseNr = 55;} // unused
                            if(btnNr == 6){_releaseNr = 56;} // unused
                            if(btnNr == 7){_releaseNr = 57;} // RADIO
                            changeBtn_pressed(btnNr); break;
        case ALARM_1:       if(btnNr == 0){_releaseNr = 60;} // mon
                            if(btnNr == 1){_releaseNr = 61;} // tue
                            if(btnNr == 2){_releaseNr = 62;} // wed
                            if(btnNr == 3){_releaseNr = 63;} // thu
                            if(btnNr == 4){_releaseNr = 64;} // fri
                            if(btnNr == 5){_releaseNr = 65;} // sat
                            if(btnNr == 6){_releaseNr = 66;} // sun
                            break;
        case SLEEP_1:       if(btnNr == 0){_releaseNr = 70;} // sleeptime up
                            if(btnNr == 1){_releaseNr = 71;} // sleeptime down
                            if(btnNr == 2){_releaseNr = 72;} // display_sleeptime(0, true);} // ready, return to RADIO
                            if(btnNr == 3){_releaseNr = 73;} // unused
                            if(btnNr == 4){_releaseNr = 74;} // return to RADIO without saving sleeptime
                            changeBtn_pressed(btnNr); break;
        case BRIGHTNESS_1:  if(btnNr == 0){_releaseNr = 80;} // darker
                            if(btnNr == 1){_releaseNr = 81;} // brighter
                            if(btnNr == 2){_releaseNr = 82;} // okay
                            changeBtn_pressed(btnNr); break;
        case DLNA_1:        if(btnNr == 0){_releaseNr = 90; mute();}
                            if(btnNr == 1){_releaseNr = 91; } // Vol-
                            if(btnNr == 2){_releaseNr = 92; } // Vol+
                            if(btnNr == 3){_releaseNr = 93; } // DLNAITEMSLIST
                            if(btnNr == 7){_releaseNr = 97;}  // RADIO
                            changeBtn_pressed(btnNr); break;
        case STATIONSLIST_1:if(btnNr == none) break;
                            _releaseNr = 100;
                            _staListPos = btnNr;

                            break;
        case AUDIOFILESLIST_1: if(btnNr == none) break;
                            _releaseNr = 110;
                            if(btnNr >= 0 && btnNr < 100) _fileListPos = btnNr;
                            else if (btnNr == 100){_timeCounter.timer = 1;} // leave the list faster
                            vTaskDelay(100);
                            break;
        case DLNAITEMSLIST_1: if(btnNr == none) break;
                            _releaseNr = 120;
                            _itemListPos = btnNr;
                            vTaskDelay(100);
                            break;
        case A2DP_SINK_1:   if     (btnNr == 0){_releaseNr = 130; mute();}
                            else if(btnNr == 1){_releaseNr = 131;} // Vol-
                            else if(btnNr == 2){_releaseNr = 132;} // Vol+
                            else if(btnNr == 3){_releaseNr = 133;} // pause/resume
                            else if(btnNr == 4){_releaseNr = 134;} // previous track
                            else if(btnNr == 5){_releaseNr = 135;} // next track
                            else if(btnNr == 7){_releaseNr = 137;} // RADIO
                            changeBtn_pressed(btnNr); break;
                            break;
        default:            break;
    }
}
void tp_long_pressed(uint16_t x, uint16_t y){
    // log_w("long pressed %i  %i", x, y);
    if((_releaseNr == 0 || _releaseNr == 22 || _releaseNr == 50 || _releaseNr == 90) && _f_mute) {
        fall_asleep();
    }
    if(_releaseNr == 110){
        uint8_t btnNr = (y -_winHeader.h)  / (_winWoHF.h / 10);
        log_i("longPressed X %i, Y %i, btnNr %i", x, y, btnNr);
    }
}
void tp_released(uint16_t x, uint16_t y){
    // SerialPrintfln("tp_released, state is: %i", _state);
    if(_f_sleeping){ wake_up(); return;}   // if sleeping

