schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
    if(request.startsWith("------")) return;     // uninteresting WebKitFormBoundaryString
    if(request.indexOf("form-data") > 0) return; // uninteresting Info
    if(request == "fileUpload") {
        savefile(_filename.c_str(), contentLength);
        return;
    }
    if(request.startsWith("Content")) return; // suppress Content-Disposition and Content-Type

    SerialPrintfln(ANSI_ESC_RED "unknown request: %s", request.c_str());
}
void WEBSRV_onInfo(const char* info) {
    if(startsWith(info, "WebSocket")) return;                           // suppress WebSocket client available
    if(!strcmp("ping", info)) return;                                   // suppress ping
    if(!strcmp("to_listen", info)) return;                              // suppress to_isten
    if(startsWith(info, "Command client")) return;                      // suppress Command client available
    if(startsWith(info, "Content-D")) return;                           // Content-Disposition
    if(CORE_DEBUG_LEVEL >= ARDUHAL_LOG_LEVEL_DEBUG) {
        SerialPrintfln("HTML_info:   " ANSI_ESC_YELLOW "\"%s\"", info); // infos for debug
    }
}

// Events from DLNA
void dlna_info(const char* info) {
    SerialPrintfln("DLNA_info:   " ANSI_ESC_WHITE "%s", info); // infos
}

void dlna_server(uint8_t serverId, size_t serverSize, const char* IP_addr, uint16_t port, const char* friendlyName, const char* controlURL){
    SerialPrintfln("DLNA_server: [%d] " ANSI_ESC_CYAN "%s:%d " ANSI_ESC_YELLOW " %s -> %s", serverId, IP_addr, port, friendlyName, controlURL);
    char id[4];
    itoa(serverId, id, 10);
    String msg = "DLNA_Names=" + (String)friendlyName + "," + id;
    webSrv.send(msg);

    _dlna_items.serverFriendlyName.push_back(x_ps_strdup(friendlyName));
    _dlna_items.serverId.push_back(serverId);
}

void dlna_folder(bool lastItem, String name, String id, size_t childCount) { // list folders
    static JSONVar myObject;
    static uint8_t i = 0, j = 0;
    if(lastItem) {
        i = 0;
        if(!j) return;
    }
    if(lastItem || j == 10) {
        j = 0;
        String msg = "Level" + String(_level + 1, 10) + "=" + JSON.stringify(myObject);
        webSrv.send(msg);
        myObject = "";
        return;
    }
    if(lastItem || j == 10) {
        j = 0;
        String msg = "Level" + String(_level + 1, 10) + "=" + JSON.stringify(myObject);
        webSrv.send(msg);
        myObject = "";
        return;
    }
    if(i < 10) { SerialPrintfln("DLNA_folder: " ANSI_ESC_ORANGE "\"%s\", id: \"%s\", childCount: %d", name.c_str(), id.c_str(), childCount); }
    if(i == 10) { SerialPrintfln("DLNA_folder: " ANSI_ESC_ORANGE "more entries follows"); }
    myObject[j]["name"] = name.c_str();
    myObject[j]["isDir"] = 1;
    myObject[j]["id"] = id.c_str();
    myObject[j]["size"] = childCount;
    myObject[j]["isAudio"] = true;
    i++;
    j++;
}

void dlna_file(bool lastItem, String name, String id, size_t size, String uri, bool isAudio) { // list files
    static JSONVar myObject;
    static uint8_t i = 0, j = 0;
    if(lastItem) {
        i = 0;
        if(!j) return;
    }
    if(lastItem || j == 10) {
        j = 0;
        String msg = "Level" + String(_level + 1, 10) + "=" + JSON.stringify(myObject);
        webSrv.send(msg);
        myObject = "";
        return;
    }
    if(i < 10) {
        if(isAudio) { SerialPrintfln("DLNA_file:   " ANSI_ESC_GREEN "\"%s\"", name.c_str()); }
        else { SerialPrintfln("DLNA_file:   " ANSI_ESC_ORANGE "\"%s\"", name.c_str()); }
    }
    if(i == 10) { SerialPrintfln("DLNA_file:   " ANSI_ESC_GREEN "more entries follows"); }

    myObject[j]["name"] = name.c_str();
    myObject[j]["isDir"] = 0;
    myObject[j]["id"] = uri.c_str();
    myObject[j]["size"] = size;
    myObject[j]["isAudio"] = isAudio;
    i++;
    j++;
}

void dlna_item(bool lastItem, String name, String id, size_t size, String uri, bool isDir, bool isAudio){
    //log_w("lastItem %i, name %s, id %s, size %d, uri %s, isDir %i, isAudio %i", lastItem, name.c_str(), id.c_str(), size, uri.c_str(), isDir, isAudio);
    if(lastItem){
        _dlna_items.isReady = true;

        int32_t s = _dlna_items.name.size();

        for(int32_t i = 0; i < s;  i++){
        //  log_w("name %s, id %s, size %d, uri %s, isDir %i, isAudio %i", _dlna_items.name[i], _dlna_items.id[i], _dlna_items.size[i], _dlna_items.uri[i], _dlna_items.isDir[i], _dlna_items.isAudio[i]);
        }

        dlna_items_vector_clear_ans_shrink();
        return;
    }
    _dlna_items.isReady = false;
    _dlna_items.name.push_back(x_ps_strdup(name.c_str()));
    _dlna_items.id.push_back(x_ps_strdup(id.c_str()));
    _dlna_items.size.push_back(size);
    _dlna_items.uri.push_back(x_ps_strdup(uri.c_str()));
    _dlna_items.isDir.push_back(isDir == true);
    _dlna_items.isAudio.push_back(isAudio == true);
}

void bt_info(const char* info){
    if(startsWith(info, "AVRC meta"))  {SerialPrintfln("BT info:     " ANSI_ESC_GREEN "%s", info);}
    if(startsWith(info, "SampleRate")) {SerialPrintfln("BT info:     " ANSI_ESC_GREEN "%s", info);}
    if(startsWith(info, "remote"))     {SerialPrintfln("BT info:     " ANSI_ESC_GREEN "%s", info);}
    if(startsWith(info, "Play"))       {SerialPrintfln("BT info:     " ANSI_ESC_GREEN "%s", info);}
    // SerialPrintfln("BT info:     " ANSI_ESC_GREEN "%s", info);
}

void bt_state(const char* info){
    SerialPrintfln("BT state:    " ANSI_ESC_ORANGE "%s", info);
//    if(endsWith(info, "Started"))    {if(_state == A2DP_SINK){ _f_BTconnected = true;  _f_BTstateChanged = true;}}
//    if(endsWith(info, "Suspended"))  {if(_state == A2DP_SINK){ _f_BTconnected = false; _f_BTstateChanged = true;}}
//    if(endsWith(info, "Stopped"))    {if(_state == A2DP_SINK){ _f_BTconnected = false; _f_BTstateChanged = true;}}
    if(endsWith(info, "Connected"))    {if(_state == A2DP_SINK){ _f_BTconnected = true;  _f_BTstateChanged = true; }}
    if(endsWith(info, "Disconnected")) {if(_state == A2DP_SINK){ _f_BTconnected = false; _f_BTstateChanged = true; }}
}

void bt_metadata(const char* md, uint8_t id){ // id_ 1 - TITLE, 2 - ARTIST, 4 - ALBUM, 8 - GENRE
    if(id > 2) return;
    if(_newBTmetaData > 1) return; // show data is in progress
    if(_newBTmetaData == 0){if(_BT_metaData){free(_BT_metaData); _BT_metaData = NULL;}}
    if(_BT_metaData == NULL){_BT_metaData = (char*)malloc(strlen(md) + 1); strcpy(_BT_metaData, md);}
    else{_BT_metaData = (char*)realloc(_BT_metaData, strlen(_BT_metaData) + strlen(md) + 4); strcat(_BT_metaData, " - "); strcat(_BT_metaData, md);}
    _newBTmetaData = 1;
}

void bt_rssi(int8_t rssi_delta){
   //log_w("rssi %i", rssi_delta);
   _rssi_bt = rssi_delta;
}